{"product":2,"Text":"I originally put this item on my baby registry because friends of mine highly recommended the use of a diaper pail.  I decided to go with the Diaper Champ rather than the more popular Diaper Genie, because I didn't like the idea of having to buy special bags.  costly[-2][u][cc]  Too costly and not efficient if you ask me!  THIS PRODUCT IS A LIFESAVER!!  I HAVE NEVER HAD AN ODOR PROBLEM!  No one has ever come to my house and noticed 'diaper odor.'  In fact, people who have been present while I changed my almost 3 month old son's diaper have been amazed at how the very 'potent' smell of the dirty diaper seems to disappear once I dispose of the diaper in the Diaper Champ.  For those who are experiencing odor problems, here are some suggestions which should solve the problem:  1. CHANGE BAGS FREQUENTLY!!  I change mine about 1 or 2 times a week.  For those who complain that the pail gets stuck, that is probably a good indication that the BAG IS GETTING TOO FULL!!  Also, making sure that the tape on the diapers is secure will prevent that from happening as well.  2. YOU STILL HAVE TO CLEAN THE THING!!  Hello, it does house dirty diapers!!  All I do is wipe it down with some antibacterial wipes (takes about 10 seconds!!) and then maybe spray some Lysol in it and let it air out for a minute or two.  SIMPLE AND IT WORKS!  Also, for those that complain that the Diaper Champ isn't as effective as time passes, keep the following in mind: AS BABIES GET OLDER, THEIR DIETS CHANGES (aka SOLID FOODS!) AND SO DOES THE SMELL OF THEIR DIAPERS!  In talking with other parents, I get the same feedback - as babies get older and become toddlers, ALL DIAPER PAILS become gradually less and less effective until they are just no longer useful.  Again, this is because as their diet changes, so does the consistency and odor of their stool, in other words, it gets stinkier!!!  All in all, this product is definitely one I would recommend and certainly worth the very reasonable price.","odor":2,"ODOR":3,"WORKS":2,"PRODUCT":3,"CLEAN":-1,"Diaper Champ":-1}