{"Text":"My original purpose in buying the Diaper Champ instead of the Genie was to use it with cloth diapers.  As a first-time mom, I got the great idea that cloth would be better, and this was the only diaper disposal that advertised compatibility with cloth diapers.  She never wore even one- the hospital started me on Huggies, and I never turned back (as a side note- if you do have the patience for cloth diapers, pay the extra $ and go for Kushies; they're beautifully made and work very well from what I've heard).  Even though I never ventured into the cloth land, I was very impressed by how well this works at keeping diapers and their accompanying odor in the pail and out of our life!  Opening the Champ to empty out the bag is a little tricky- I pinched my thumb a few times before I got the hang of it.  Being a very economical person, I appreciate the fact that any plastic bag can be used with this system- I never did like the prospect of buying special Diaper Genie refills.  If you have a really sensitive nose, I can suggest buying some scented kitchen trash bags to use with the Diaper Champ- since the odor is contained in the Champ, once you have to open it to empty out the full bag, you're quite often greeted with a rather unpleasant blast of odor, and scented bags help with that.  As one other reviewer pointed out, it does occasionally take a little effort to push down the \"plunger\" to get the diapers in the pail, even though upon inspection the bag doesn't really look full.  But from my experience, by the time it gets to that point, the bag is really heavy, so I think this is kind of helpful- it's a built-in way of keeping the bag manageable upon emptying.  This is a really great buy, for yourself or as a shower gift.  I'm beginning to think that the main reason Genie's so popular is their cutesy name.  It's certainly not worth the money or the upkeep.  Go for the Champ.  It lives up to its name.","Opening":-1,"emptying":1,"pail":3,"refills":3,"plunger":-1,"Champ":3}