{"Text":"Hitachi's M12V is a big beast of a router.  weight[-1][u][cc],  It's not the heaviest around (I think Porter-Cable has that distinction), but I found its combination of weight and power really too much to allow precise handheld operation.  Luckily, the only significant handheld use I had to put it to was to plunge cut the melamine board that I dropped my Woodpeckers PlungeLIFT table insert into.  Hitachi includes a 1\/2\" straight cutting bit in the package, and I used this to cut out my table.  I bobbled a bit at the end of a couple of the cuts because the momentum of the charging M12V was a bit more than I was prepared for.  And changing bits requires one hand on the wrench, one hand on the spindle lock, and two knees to hold the router -- another reason why the M12V is best used in a table.  In my table the M12V has been a real champ.  I've cut dadoes, flush trim to duplicate a complex form, and done roundovers and Roman ogees.  The heavy motor and continuously variable speed control let this router churn through everything I threw at it.  With the PlungeLIFT all my bit changing has been done above the table, although I still have to reach below the table to operate the spindle lock (and, of course, the speed and ON\/OFF controls).  Accessories included in the package are: - 1\/2\" shank, 1\/2\" diameter, 1\" cutting length, 2 carbide flute straight bit - parallel guide - template guide - template adapter for 3rd-party guides - 1\/4\" chuck sleeve - cutting depth fine adjustment knob (which takes a \"13 mm\" wrench to install, but a crescent wrench works OK too)  Not included are: - 3\/8\" chuck sleeve (the least common bit size) - depth scale in mm (the included one is in inches) - dust collector set - trimmer guide for chamfering  The M12V is really set up for right hand operation.  Lefties can switch the angle of the handles by loosening the screws, repositioning, then retightening.  This will allow operation of the power switch with the left index finger and the plunge lock with the left thumb (instead of the standard right thumb and right index finger, respectively), but then the depth scale is on the back face of the router, as is the straight edge of the base plate.  Nice things about the M12V: - in a table, the powerful 3 1\/4 HP motor is great - soft start helps a lot to control the beast when you turn the router on - continuously variable speed control - Amazon's price  Not so nice things: - a bit too much weight and power for easy handheld use - spindle lock makes for awkward bit changing (outside of a table) - the 1\/4\" chuck sleeve requires MUCH tightening to keep bits from slipping  Bottom line: Highly recommended, but best when used in a table.","controls":-1,"weight":-1,"speed":1,"router":2,"motor":2,"power":-1}