{"Text":"So far it has worked out great\t I  held out for the 4th generation 20GB iPod when I heard that it was coming equiped with the 'click wheel', that had previously only been available for the iPod 'mini'.  I found that to be the most impressive thing about the iPod 'mini' - basically for ease of use, and the feel it gives.  It was worth the wait.  The 'click wheel' is much easier to use, compared to the previous generation's models with the touch screen.  It takes seconds to work the menus and go from song to song.  This unit comes with the USB\/firewire cable as a standard item now.  Does not come with the dock, remote control, or carrying case like the 3rd generation units - but you get $100 off the price, so you can still end up with the same accessories, and a new generation iPod for the same money.  I have transferred in about 2,400 tracks so far - very easy to use both the Ipod and iTunes.  Both are EXTREMELY user friendly and take minutes to get used to.  Backing up your iTunes library takes a short amount of time.  Two DVDs to capture all 2,400 tracks.  Burning CDs from iTunes is much easier than the Windows Media Player, which I was previously using.  The first battery charge lasted only about six hours.  That may be due to the fact that I used the menus a lot, and had it hooked up to the Griffin iTrip (The iTrip works great) for most of that time.  The second battery charge lasted over twelve hours.  I used it mainly on shuffle play and shut off the \"click\" sound to get this much life out of it.  I was worried about what the sound quality would be like, but that seems to be just as good as the actual CD sound.  I bought the JBL Creature speakers for home use, and they work great with the iPod.  Match them pretty well to boot.  The only area I wish Apple had improved upon would be the screen.  It is sharper on the 'mini' units.  This is only a problem at night, during the day the screen is very easy to see.  The backlight helps out at night, but can be a drain on the battery.  You can adjust the time the backlight stays on (or turn it off completely), so it's only a minor issue.  The first time I took it in the car, and was able to chose from hundreds of CD titles, thousands of songs, to have all of that at my fingertips was a great experience.  Talk about convenience.  I would strongly recommend you get one !!","screen":-1,"USB":1,"use":2,"sound quality":2}