{"iTunes":-1,"Text":"The Great And Versatile iPod\t I love my iPod!  I have wanted one for a long time, but just didn't want to spend the money.  I wish I had a long time ago.  The sound quality is excellent, accessing the music is easy, and the controls are generally well thought out.  As a Windows user, I had to install the software including drivers and iTunes on my desktop, and this is the only area where I encountered a nuisance.  The first install did not work correctly and would never transfer music to the iPod (but did allow me to register with Apple and load songs into iTunes).  Eventually I had to uninstall the whole works and reinstall it from scratch, and from then on it has worked like a dream.  I still give the iPod five stars, though, as it could have been something I did incorrectly during the install (though I did follow the onscreen prompts) so I'll give Apple the benefit of the doubt.  My only regret is that I bought the 20GB model, which is way too big for what I really need: I would have been better off with a smaller model of lower capacity.  Perhaps over time I will fill it up, but with almost 250 songs on my iPod now and less than 1GB used, I have a long way to go.  That's the only advice I would give to someone considering an iPod purchase: you really may not really need 20GB or 40GB.  The iPod does come with other nifty software accoutrements, but honestly I haven't used them much as I use the iPod to listen to music while I run or on a plane.  The battery holds a charge for a very long time (maybe 15 or so hours of use) so realistically there are no real range or endurance issues associated with iPod use.  My only complaint (really more of an observation) is that the outside finish of the iPod is rather delicate, so I am going to get a case for mine so it doesn't get all scratched up.  (It sure does look nice, though!)  I recommend this to any music lover anywhere: the quality of the audio is excellent, the controls and indicators rapidly become intuitive, and the storage capacity and battery life are huge!","Versatile":2,"sound":3,"battery":1,"quality of audio":2,"iPod":3,"outside finish":-2}