{"click wheel":2,"games":-1,"Ipod":2,"scratches":-1,"Apple":2,"sturdy":2,"product":2,"iTunes":2,"Text":"God Save Apple\t I have been an Apple person since 1984, when I got my first Mac.  Since then, I have been a devotee of the elegant styling and functionality of all things Apple.  The Ipod is a fine cousin to the early macs and current offerings from Jobs and Company.  Long live Apple, long live Macs, and long live the Ipod!  I have an ipod and it is a great buy.  It holds a ton of songs and looks cool in the palm of your hand.  Very sturdy and strong.  Doesn't have alot of good games on it.  the 20 gig because that holds 10,000 songs right there and that's alot of songs.  buy it.  iPod is brilliant, but service was awful  Wow iPod.  How did we listen to music before it?  This 20 gigabyte iPod by Apple Computer allows you to put up to 5000 songs onto it, in a choice of digital formats.  MP3, AAC, etc.  The software with the iPod includes iTunes, which allows you to play the music on your computer, rip CDs onto your computer, and move your music from the computer to the iPod.  iTunes is a great piece of software, and you can also buy songs from the iTunes Store at 99 cents per download.  This new click wheel iPod allows you to navigate through the menus and song via a touch-wheel for scrolling and click-able buttons for selection.  It allows fast and easy navigation.  The backlit screen of the iPod is also easy to read.  The song quality of the iPod is excellent, and the included ear buds are actually more than satisfactory, for most users.  The back of the iPod is in a chrome finish, and this surface is prone to scratches.  It is best to protect the iPod in a case of some kind.  Battery life keeps improving on the iPod, and a new iPod will give you up to twelve hours of play time, per charge.  I use my iPod all the time.  You can also use it as an external hard drive to back-up documents, photographs, etc.  The problem with my iPod.  The first one I received skipped songs randomly.  I had to send it in for repair, and it took six weeks to get a replacement back to me.  I actually had to contact Apple's Vice-president, in order to get the situation resolved.  However, he quickly helped me, and I have been enjoying my replacement 20 gigabyte click-wheel iPod for several months now.  Thank you Apple!  You make fabulous products.  The product I rate five stars,  but I had to give you four because the service for my brand-new iPod was terribly slow.  However, you should still buy an iPod!  The chances of getting a flawed one is very small indeed.  Plus, if you order from Amazon.com, they will exchange it for you no problem.  I had ordered a customized one from Apple.com, so I couldn't exchange it.  iPod will change the way you enjoy music!","Battery life":1,"ipod":2,"service":-2,"Amazon":2,"iPod":3,"song quality":3}