{"click wheel":2,"iTunes":2,"Text":"Not perfect, but I'm still enamored...\t I've had an iRiver MP3 player for a year or so now, and it's really great for listening to the radio.  It's small and lightweight, but it has very little storage space and the shape is clunky.  I set my sights on this super sexy iPod and didn't stop until I finally had one in my hands.  I am so in love with this thing I can hardly stand it.  It's got LOTS of pros, and a couple minor cons, which I will outline below.  It's still an absolutely unbeatable value for the amazing technology you're getting, so don't let a few petty cons dissaude you from owning THE coolest thing on the planet right now for any music lover.  The iPod is a little more weighty than I expected, but it's not unmanageable.  The arm band is fantastic and it doesn't budge even at the gym.  I love the slim design; the weight would only be an issue if it were bulky.  The ear buds that come with it look cheap, but the sound quality is amazing.  It sounds 10 times better if you use the little black foam cushions that slip over the buds.  The click wheel is incredibly convenient, however it can be a little overly touchy at times, which will make you frustrated with your own fingers.  A lot of this has to do with being so excited when you first get it that you get beside yourself and have to force yourself to slow down.  ;)  I love the shuffle function, which virtually eliminates the need to touch it at all.  I use mine mostly at the gym, so this is fantastic for me.  It charges quickly and holds a charge for a very long time.  I love that it allows you to stop and turn it off in the middle of a song if need be, and when you power it back on it will continue right where you left off!  I am a big fan of iTunes, simply because it is terribly fast and convenient - IF you are buying the songs from the iTunes site.  However, I have found that converting my CD's and MP3's into the iTunes library fo!r upload takes a fairly annoying chunck of time.  It's the biggest pain in the rear end of all the cons, without a doubt.  Of course, once the songs are converted, you don't have to worry with them again.  It's very fast and easy to create custom playlists for upload.  The only other problem I have noticed is that on some uploads it will switch around CD song titles (all on the same artist, it just mixes up the titles).  I have no clue why this happens, as they show up perfectly in my iTunes library and there was no interruption during the uploads.  It's really no big deal to me, but is worth mentioning.  All in all, the good far outweighs the bad.  This is the first line of Apple products I have owned (we also have an iPod mini and are about to purchase a shuffle).  I am so impressed with the iPod that our next purchase will likely be a Mini Mac.  Way to go Apple!  You've earned a new fan.","arm band":2,"sound":3,"Apple":2,"design":2}