{"Text":"Would be FIVE STARS, except for MAJOR FLAW  Let me say first, that I have always been a hater of all things Apple.  However, after holding an ipod at circuit city, I knew I had to have one.  When I finally got it, I was amazed by how asthetically pleasing everything was, including the packaging.  The ipod itself is very pleasing to hold with its smooth surfaces.  The only thing that protrudes slightly is the \"hold\" switch.  For this reason, it is very easy to drop.  One of the other reviewers said get the neoprene case from marware, which is great advice.  I have almost dropped the ipod several times, just because it is so smooth.  Everything else about the ipod is great, the click wheel is very easy to use and so is the software that comes with it.  To adjust the volume, you just sweep your finger lightly along the click  wheel.  Organizing music is a breeze too.  You can put songs in multiple categories, which is great.!  Finding all the albums, songs etc is much easier than you would think it would be even if you have 20 gig (well 18 gig) worth of music.  It all sounds great too.  As with most headphones that come with any type of music player,I recommend throwing these into the nearest river, unless you like having hard, round pieces of plastic in your ears.  I recommend Shures (shure.com).  I have the e3c's, and man does everything on the ipod sound great.  You can even use the ipod to store files from your pc and export your outlook files to it.  I use a great free program called ipod agent to do this.  The outlook is a little clunky to use on the ipod, but it is functional.  I LOVE THIS IPOD!  So why, you ask, did I give it only one star?  Because Steve Jobs is a twisted individual and he made sure that he ruined this device by giving it an UNREPLACABLE 18 MONTH BATTERY.  To see a great little short film about this, go to ipodsdirtysecret.com   Basically, this is a disposable device, the idea being that when the battery goes out, you will buy the latest model of ipod.  This was obviously a conspiracy as it is FREAKIN' EASY to manufacture a device with replaceable batteries!!  If you can get past this little flaw, give the ipod 5 stars, because everything else about it is pretty much perfect.  However, in my mind, $299 is a lot to pay for a device that will only last 18 MONTHS.  Hence, the one star rating...","store":2,"batteries":-3,"pay":-3,"BATTERY":-3,"headphones":-3,"sounds":3}