{"Text":"It did not take me that long to set this up, but it did require *not* following the instructions.  I had an old wired Linksys router.  The new wireless router contained large warnings to run the CD first before trying to connect it.  There was a big sticker inside the box saying \"RUN CD FIRST - DO NOT DISCONNECT YOUR CURRENT ROUTER\".  And the router itself had protective tape over the Ethernet inputs.  So I ran the CD, but doing that did not yield any results - my wired router was apparently too old, so the CD s\/w did not recognize it.  instructions[-2][u]  There were no other obvious setup instructions - though there was a softcopy manual, it did not give an answer readily on what do to.  If I did not know anything about networking whatsoever, I might be stumped at this point.  But since I do have a little experience, I simply disconnected my old router and put in the new one.  I do know what wires go !  to which inputs, I know what the lights mean, etc.  So then running the CD, everything worked out OK to connect my wired computers again.  security[-2]  The only other problem was that security for the wireless connection.  There was no obvious screen stating what should be done - the program simply said the router was secured.  If I did not know what to do, I'd have no idea how to connect wirelessly.  But knowing that the IP for my previous Linksys router was 192.162.1.1, I went there and found a drop down screen that had the information (the security key) I needed to connect my wireless laptop.  works[+2]  The router works fine for both wired and wireless.  connect[+3][u]  I can go pretty far away from my router and still connect wirelessly.  connect[+2][u]  Overall, if you know what basic steps to take, it was not difficult to connect, and the s\/w worked well to connect.  But if you did not know what to do, you might have to call Linksys.  I would suggest for Linksys to include a hardcopy quickstart guide for those users with !  CD[-2][u]  little to no networking experience, just in case the automatic CD method has issues.  router[+2][p]  I'd give it 4.5 stars if possible, but since 5 stars would be misleading, I give it 4 stars."}