{"Text":"I tried and failed using the D-Link 624 108M wireless router.  Coverage in my 2-floor brick-walled house was poor and erratic.  I would never get 108M rate unless I was half a meter from the box.  Two walls apart from it, the signal would start failing.  antenna[+1]  When I saw a high gain (low price) antenna was available to the WRT54G router, I thought I'd happily give up some (practically unattainable anyway, since you've got to be in spitting distance from the router) speed in favour of wider coverage.  Important to note that what I really needed was an access point as my DSL modem already does the router thing and I have a wired 100M network round the house.   setup[-1]  Setting up the system was not too complicated.  Firstly, I mounted the 7dbi antenna pair, replacing the original ones.  Then, the hardest bit was to figure out how to disable the router and the DHCP services so that all computers woul!  d be in the same IP range and see each other.  Basically, I set up the box to work as \"router\" (!  ) as opposed to \"gateway\", disabled DHCP and gave the router an IP number within the range served by the DHCP service from the modem.  Also, I set up a WPA-PSK security protocol, and created a corresponding profile in my notebook.  All this took a couple of hours fidling, as I did not go to Linksys website for support - so I wouldn't know if there is help there.  signal[+2][u]  Having done all this, I was quite pleased to see that all corners I needed were decently covered by the signal.  speed[+2]  The box is upstairs, and in the farthest room I get connected at 11-18M speed - that is similar to the older 10M ethernet standard.  For surfing the net it is more than one can hope for.  If it is needed to make a multi-100 MB disk tranfer (such as back-up copies) it makes sense to connect through the wired network.  signal[+2][u]  Apart from speed, the signal is consistent and works without interruptions, etc.  In my oppinion,!  coverage[+2][u]  the WRT54G plus the HGA7T is a perfect solution if you need wireless coverage in a wider area or for a hard-walled house as was my case."}