{"Text":"signal quality[+2] ##A decent peice of hardware with great speed (I get the same speeds as with my comp connected directly to the modem)  and good signal quality.  look[+1]  I guess the two antennae help with that besides making it look cooler.  speeds[+2]  I am getting better speeds on all my web programs.  router[+2][u][cc]  There seem to be fewer collisons and dropped packets as I read from the router logs than with my old Dlink router.  setting[-2]  I had a lot of problems setting it up, since the software given along with it is buggy.  firmware[-2]  The firmware has bugs too, so download and install the latest firmware from Linksys.  VERY IMP.  After installing the firmware hold the reset button at the back for 30 secs.  Also use Netstat on the Linksys website which helps in setting it up.  instant setup[-2]  The instant setup button in the front of the router messes up the network it is better to configure the router manually.  router[-][cc]  This is NOT a router I would suggest for a novice user, my old Dlink DI52!  4 was much more easier to setup but had slower speeds and not as configurable as this.  VOIP[+2]  It works well with my VOIP adapter, which is also a Linksys.  At first I was going to give it a really bad review.  connection[-1]  The internet connection would go down every 5 mins when I used it with a P2P program called Bitspirit.  The UPnP and NAT traversal features have some kinks that will be hopefully fixed in the later versions of the firmware.  But this seems to be isolated only to the latest version of this particular program.  Pros.1.Speed  2. Signal Strength  3.Advanced Configuration Options  So-So 1. Customer Service - 6 calls Half were efficient other half were equally incompetent.  ##Cons. 1. Configuration is not easy as it made out to be 2.Lousy Initial Software 3. Does not work with BitSpirit with UPnP, Besides that its an excellent choice , If you know your way around network configuration go for it.","speed":3,"Customer service":-1,"signal":2,"Configuration":-2}