{"look":3,"Text":"style[+1] ##I bought my Zen Micro three months ago mainly because I preferred the size and style to the iPod mini.  player[+2]  Overall, I've been very impressed with the player.  functioning[+2][u]  I've had almost no problems with the firmware (ie, lock-ups, shut-downs etc), but I have kept the player up to date.  Also, the latest version of the firmware seems to actual deliver (in fact, more than deliver) the 12 hour battery life the specifications claim.  Originally I was only getting around 8 hours of playtime out of my Zen Micro, but now I consistently get 10-13.  firmware[+1]  I'm not sure whether this is related to the charge cycle of its Li-Ion battery, the better firmware, or a combination of both factors.  battery life[+2][u]  I imagine if I left my player untouched (no backlight) it could play for considerably more than 12 hours at a low volume level.  sync to windows media player[+1]  One of my favorite features about the player is its ability to sync to Windows Media Player.  With the latest version (10), I can simply browse my WMP library, adding songs\/albums\/artists to the sync list, and then sync all of the tracks at any time.  look[+2]  Its just as fast as the included Creative software, but much less invasive, and overall better looking.  With WMP10, you don't need to install any software other than the driver, which makes using multiple computers fairly simple.  touchpad[+2]  The touchpad is great once you get used to it, and I much prefer it to standard buttons or scroll wheels (as on the Dell DJ for example).  touchpad[2][p]  They are sensitive and accurate (perhaps too accurate, it senses through t-shirt cloth, but the touchpad can be locked), but easy to clean, unlike buttons.  touchpad[+1]  Also, the touchpad seems to be waterproof to some degree.  FM reception[-2]  The FM radio's reception isn't spectacular, but it will pick up the most powerful stations in any given metro area.  radio record[+1]  Its ability to record radio is useful as well, but would have been moreso if it could be preset.  sound[+3] ##The player looks great, feels great, and sounds great.  durability[+2]  So far it has been very durable (other than the little pads on the earbuds), but those aren't really necessary as I find them comfortable on their own.  earbuds[+2][p][cc]  They also sound excellent compared to other earbuds including retail sets like Panasonics and Sennheisers.  built[+3][u]  I've dropped the device several times onto hard surfaces, and it still works flawlessly.","size":1}