{"look":2,"Text":"so i admit it... i wanted a zen micro, because the appeal of the iPod was overshadowed by it's annoying trendy hipster popularity and i felt better about myself for choosing a rip off version of that trendy hipster popularity.  player[+2][p]  anyway, my wife got this for me for my birthday and I love the thing.  I mainly only get to listen to music in my car, so it's an awesome replacement for a console full of the same ten cd's that have been in there for the last 8 months that i keep forgetting to replace.  she also got me an iRiver FM modulator that plugs into the ligher outlet, so i can play it through my regular radio.  anyway, here's the pros and cons:  +linux compatible with the 1.x series of firmware.  firmware[+2][p]  the program is called Gnomad and works great for me and seems to cover all the features the included windows sofware does.  accessories[+2][u] ##+looks snazzy +smaller than a pack of smokes - easily transported +ac charger included as well as a hardshell that comes with a clip and a stand adapter +USB cable !  included - charges via USB, so whenever you plug it into your computer, it's charging up.  sound quality[+3] ##+Battery life is awesome IF you upgrade the firmware [requires a windows pc] OR make sure to always plug the ac adapter into the player before plugging into the outlet +Awesome sound quality... I mean it is Creative right?  Aren't they something of digital sound experts?  navigation[+2]  +Sorts music by artist, album, genre, etc... it's easy to wade through 5 gigs of tunes to find what you're looking for.  Also provides for playlists which are nice, but really only usefully set up through the PC software.  before i get into the cons, i'll make a note about the scrollpad.  scrollpad[-1]  It DOES take some getting used to.  my initial reaction was to tap the up and down arrows, when in reality, you need to touch, maintain contact and slide your finger up and down.  it's a little counter intuitive at first, but works great when your used to it.  it's a neutral feature in my book.  simple mechanical buttons would probably work !  just as well and would be less confusing for new owners, but i guess they wanted to rival the iPod's search wheel.  charging[-1]  whatever...  on to the negatives:  -touchy about charging... you can damage the battery and seriously decrease it's life if you don't upgrade the firmware OR dont' heed the advice to always plug in the player side of the cord before plugging in the outlet side.  -doesn't like to be charged via USB on non windows PCs or PCs that don't have the Zen Micro driver installed.  button functioning[-2][u]  It has the odd side effect of the buttons only partially working?  Simply removing the battery and then replacing it fixes the issue, but it's annoying.  The new firmware fixes this as long as you put the player in lock mode before plugging it into said PC.  users guide[-1]  -User's guide doesn't cover a lot of important info that is covered on their website.  I definately recommend upgrading the firmware, which is as simple as downloading a program from creatives website and running it with your player plugged in.  (linux geeks -> avoid the 2.x series that is aimed at windows media play!  er compatibility, you can't downgrade the firmware.  heat[-1][u]  ) -Can't be left in the car... it immediately shuts down with an overheating error if left in a hot car for too long.  size[+1][u]  But since it's so small, it isn't a big deal to bring it with me.  player[+][p][s]  Overall though, i'm very happy with it and highly recommend it to folks looking for a mp3 player, even if it is to pretend your not a braindead consumer giving into the marketing hype of the iPod. ;)","battery life":3}