{"Text":"Two days after writing this review below, I want to remove another two stars.  I just discovered another con in my list of pros and cons.  Zen Micro[-2]  This one is particularly bothersome: Allegedly one can use the Zen Micro as a portable drive to store and transport data from one computer to another.  Ahhh! There is a catch, the manufacturer does not tell you.  INSTALL[-2] ##Although you can store any type of file on the Zen Micro to download onto a different computer, you need to INSTALL (on the computer you are moving the data to) Zen Micro software and drivers to do it!!!  I just tried to move a load of plain data files from my home computer to my office work computer, and it is promting me to install Zen Micro software, etc....  I have used similar devices and they are seamless and simple.  software[-2]  Who wants to go through the hassles of loading software onto a \"foreign\" computer just to move over some simple (*.txt) files?  This brings my review to one star!  But Amazon won't allow me to reduce the number of stars once I have already established three two days ago.  portability[+2] ##The sound is great, the portability, etc... all the \"stuff\" you expect from a good MP-3 player, this Zen Micro has it.  It COULD have been a great product.  Why isn't it?  Read the next six mixed pros and cons: .  1.  Button sensitivity[-2]  ) Button sensitivity: Even reduced to the lowest sensitivity setting, the buttons are far two sensitive, really takes some getting use to, and even then, it is still too sensitive.  The company has received thousands of complaints about this and refuses to do anything about it. .  2.  recharge cord[-3] ##) WORST FEATURE POSSIBLE, THIS ALONE MAKES IT RATE ONE STAR: What's up with no recharge cord?  You have to purchase that separately for some outrageous cost.  If you want to recharge it, you MUST connect it to your computer.  The recharge cord will do the job in a fraction of the time that the USB cable will hooked to your computer.  charged[-2]  I took my Zen Micro with me over the weekend, and was forced to lug my laptop with me on the trip for one reason: to keep the Zen Micro charged.  Infuriating! Nearly all other MP-3 producing companies include a recharging cord with their product that can be plugged into a wall socket.  If you want a wall-socket recharging cord, you have to dish out somewhere between $30 and $35, plus shipping and handling, for a cord that cost less than $1 to manufacture and market.  product[-2]  I have trashed this product on other opinion sites based on this major flaw alone.  What is up with nickle and dimeing consumers on the recharge cord?  Buy from another company and run from Creative, Inc.  Their product may appear more enconomical, but it isn't in the long run. .  3.  prices[-3]  ) Creative, Inc. the maker includes the barest of the bare minimum in the box, then through gross profiteering nickles and dimes you on EVERY single accessory at extraordinarily inflated prices.  case[-2]  The box included a little polyester, pull-string BAG, (yes, you read right a BAG, something a boy would carry ten marbles in) and tries to pass it off as the case.  case[-2]  If you want to purchase a real case or container or clip-on carrier for you Zen Micro, expect to purchase it separately and to dish out big time. .  4.  battery[+3]  ) One outstanding positive feature is the battery. It holds a charge for a long time, longer than most other similar products and the user can replace it easily or take another along as a backup.  Some other companies require you to send your player back and then charge you an additional $130 to replace their batteries.  rechargeable battery[+3]  Creative did well on its rechargeable battery feature. .  5.  ) I purchased this device primarily to record off the built-in FM receiver for lectures and seminars that are broadcast live over a FM signal for the hearing impaired.  FM receiver[+1]  The Zen Micro FM receiver is ok, not great.  FM receiver[-][cc]  IRiver has a better FM receiver built in, but the drawback to IRiver products is they are flimsy and poorly constructed.  I have gone through two of them in two years. .  6.  constructed[+3][u]  ) The Zen Micro appears sturdy and well constructed, hefty, if you will, far better than many of its competitors. .  charges[-2]  As I wrote, this COULD have been a great product, but expect hidden charges (read gross profiteering and price gouging) as the company royally sticks you on every conceivable accessory necessary for normal daily usage.","store":2,"sound":3,"FEATURE":-3,"cost":-3}