{"Text":"I'm addicted to music.  I'm also somewhat of an audiophile.  Mp3 players are like a blessing and a curse for people like me.  On the one hand, you have the ability to store and plays over 1000 songs on one little piece of machine.  On the other hand, you get terrible sound quality.  I decided to go with the convienence factor and purchase a creative zen micro.  I was at [random electronic store], browsing through players, and came across two that made the cut.  The first was an ipod 5gb (I could kick myself for not buying it), and the other was a creative 5gb.  The creative came with a free trial of [random file sharing company] \"to go\".  So that's the one I bought.  Too bad.  made[-3][u]  First thing I noticed was that the creative wasn't well made.  One drop from a pocket or desktop, and it'd be a goner.  sound[-3]   Problems with the sound quality were evident right away, but even I couldn't imagine they'd be that bad.  bass[-3] ##The eq is awful, and even at top volumes, the bass is flat sounding.  volume [-1]  Cranking the master volume level up past the mark of the bar only leads to distortion and compromised sound quality.  headphone jack[-3]  The headphone jack gave out after only a couple weeks of use, and the stock earbuds were replaced same day with some high end sony's I'd been having.  They didn't really make any difference.  I also experimented with an adapter for the car.  sound[-2]  If you've been listening to cd's in your car for awhile, dealing with the drop-off in sound quality may take some getting used to.  car adapter[+2]  However, if there was one thing I liked about the creative, it would be the car adapter.  Hands down, better quality than ipod's.  that isn't saying much, but hey, I like to be positive.  storage[-2][u]  Even after all the nightmare sound problems, I'd still half-way like this product if it kept it's promise; the ability to store 1500 songs.  storage[-2][u]  I got about 700 loaded up before it told me I was full, and at that point, I was ready to toss it out the window.  If you do not care about sound\/music quality in the least, and don't mind the ability to store 800 songs less than promised, get the creative zen micro.    Otherwise, you should get an ipod.  creative[-][cc] My friend has an ipod, and although the sound quality probably won't meet most audiophile standards, the product itself is better than anything creative has made.  features[-][u][cc]It hold's a promised amount of songs, and the headphone jack\/volume controls deliver a more impressive performance than creative's.  If you're an audiophile, you already know that mp3 players are far from impressive.  player[-][s]However, this one makes an ipod sound like your old LP's, so even if you're a casual listener, I'd advise that you avoid the purchase of this product. Terrible.","player":-3,"eq":-3}