{"Text":"After narrowing my choices down to the Zen Micro or IPod Mini, I read countless reviews on both for about a week until my eyes practically started bleeding.  I really like both of them and as with any other popular products, they both have their share of negative reviews warning of their shortcomings.  When I finally couldn't take it anymore, I decided to pull the trigger on the Zen Micro.  features[+2][u] ##The extra GB of hardrive space, removeable battery and FM tuner, as well as the fact that I was previously a satisfied owner of the Nomad II put it over the top for me.  Not to mention that everyone else at the office has an IPod, so I was kinda' hoping for a good alternative.  working[+2]  Fortunately for me, I have yet to have a single problem with this player.  After reading the reviews, I was all ready for the unit to lock up on me after the initial charge...but it never happened.  controls[+2] ##I think the OS and controls are very well thought out and although I'll admit I was a bit intimidated during my first few hours with the Micro, the interface and controls became second nature after the first day or so.  My preference for the touchpad sensitivity setting is 'medium'.  One reviewer made what *I thought* was a good point about the volume not having an independant control and being buried in a menu, but must not have spent very long with the player because if you slide your finger up or down the center touch button during a song, the volume goes up or down accordingly.  A few reviewers have also complained about the printed manual which is probably one of the biggest wastes of paper ever included with an electronic device.  manual[+1]  However, there is a more detailed PDF manual on the CD (and online) that should answer any questions about the operational features of the Zen Micro.  software[-2]  While the software may not be as easy as I-Tunes, it is not difficult to use by any stretch.  loading speed[+2]  As opposed to the Nomad II or any other flash based player, the songs load extremely fast...about one or two seconds per song.  editing titles[+1]  I also like the fact that you can edit your MP3 titles, etc.  after they have been loaded into the Zen which is something I've had to do many times already.  sound[+2]  After comparing the included Creative earbuds directly against my Sony MD-E828LP's and Sennheiser MX-400's, I find myself still using the Creative's, which in my opinion, sound every bit as good and have a slightly longer cord.  FM reception[-2]  If I was pressed to find a negative aspect of the Zen Micro I would probably have to mention weak FM reception, but the building where I primarily use the Micro seems to have a history of terrible radio reception anyway, so you can take that for what it's worth.  Zen Micro[+2][s] Overall, I'm very pleased with the Zen Micro and based on my experience with it (as well as it's older sibling Creative Nomad IIC), can recommend it without reservation.  I say get one today!!","interface":2,"storage":2}