{"Text":"... then this might intrigue you greatly.  The hook with this MP3 player, distinguishing it from the others, is clearly going to be the OS applications it provides.  Finally, someone has figured out that building some smarts into the player will help it compete with iPods.  The latest craze for MP3 manufacturers is the 5Gb microdrive, a 25% boost from the 4Gb ones supplied by Hitachi.  At this point, the Rio Carbon is 5Gb (along with a host of South Korean manufacturers), and eventually the iPod will get a \"free\" upgrade to 5Gb as the 4Gb trickle down to nothing.  Then what?  What compels you to choose one over the other?  It has to be the UI and user experience.  The Carbon is nice but offers no improvement to the near-perfect iPod experience.  The scroll wheel is not an Apple innovation, but it took Apple to put it on their MP3 player for the obvious to become clear to the industry.  So tack on a scroll wheel and... you still have to compete against the intuitive OS-based application that an iPod offers the user.  It's easy to find songs, organize songs, and also carry some essentials and diversions.  The iPod gets it right, the Carbon doesn't.  Today, the Creative Zen Micro proves it, too, gets it right.  Outlook compatibility[+2]  Better for the Zen Micro is Outlook compatibility.  This makes the Zen Micro the first choice for MP3 owners with a Windows-based system.  I'm not professing to be a consumer-survey corporation, but I don't know *anyone* with an iTunes account.  However, I do know about a dozen people with well over 4000 MP3s each.  What device would I recommend?  Well, if size matters, and you like the idea of a lime-green or bright yellow device, then I'd have to go with a Creative Zen Micro.  accessories[+2] ##Creative has excellent music software, a very responsive tech support group (they are quick on firmware updates, and make them publicly available), and usually a good array of accessories.  additional accesories[+1]  The Zen Micro is no exception: in addition to the case, it comes with a neck strap, and has all of the necessary cables for syncing and charging.  extra battery{+2]  The extra spare battery is just a neat bonus.  player[+2]  If I could, I'd trade-up on my Creative Muvo2 and snag a Zen Micro tomorrow.  **** I gave up a ton of positive reviews to add this addendum.  I do not work for Creative; I had a chance to play with a review copy in-depth, as others have (See Engadget, Gizmodo, or c|net as examples).  Just because Amazon doesn't have it to sell doesn't mean the product is unavailable for review.  Please judge any review you read -- in any medium, be it here or newspapers or magazines -- by its own merits. ****  Fred","software":3}