{"Text":"If you're considering an iPod mini or even an iPod, read this.  I looked at the market extensively and took a lot of advice before making the big buy here.  I wanted a player that had good capacity, construction that can stand up to exercise, good sound quality, good battery life, good looks, compatibility, and a fair price.  Tall order, eh?  compatibility[+1][p]  Actually, the Creative Zen Micro solves all that.  sound quality[+3]  Sound quality? Phenomenal.  sound quality[+][cc], earbuds[+2]  unarguably better than Apple's, and nice earbuds to boot.  Looks?  Let's just say it's no coincidence I put \"Foxy Lady\" on there.  variety of colors[+3][u]  Your choice of ten colors in a beatiful package.  Capacity?  Apple has tried to hide something from you: most people don't actually need more than a few gigs at most.  storage[+3][u]  Five gigabytes is plenty for my great albums.  (Like I really wanted \"Hotel California\" anyway.  )  Construction?  construction[+3][u]  Tough as nails.  construction[+3][u]  No skips, and it hasn't faltered once (despite your inevitable drop or two.  )  Compatibility?  compatibility[+3]  Flawless.  They've partnered with Napster to give you a! free month of the subscription service (read: all the music you want free for thirty days, when you can cancel with all your music safely hidden away.  play WMA[+2]  ) No locked-in proprietary business like Apple; this baby plays WMAs too.  player[+][cc] ##The voice recorder is a beautiful add-on; not even necessary, but just an example of why Apple just wants your money and Creative Labs wants to make a better player.  sound[+3]  Gets nice sound too.  FM tuner[+1]  The FM tuner is just a little spare icing on the cake.  And the price?  A bargain $200.  Do NOT buy Apple.  Inferior quality at a higher price (and shoddy reliability) is not quite justified just because they have a better spokesperson.  player[+3]  In conclusion, this player is beautiful.  power[+2] ##Power for the tech-savvy, ease of use for the less fortunate.  player[+2][p]  But it; you won't regret it.","ease of use":2,"voice record":2}