{"look":3,"Text":"if not amazed, I won't go into the kind of detail many people have here, but I do want to say a few things about my experience so far (I've had it about two weeks) with the Zen Micro;  these are the things I was curious about when I was shopping around.  player[+2][p]  On the whole, I'm quite happy with the purchase.  storage[+2][u] ##The sound is bright and clear, the ability to store any MP3's (and not just Apple-approved files) is great, and I plan to make use of the storage space and sound recording from time to time.  interface[+2] ##The device looks very cool, I think (exactly as the photos promise), it's comfortable and lightweight in my jacket pocket, and the interface and controls are easy enough to navigate after a bit of practice.  srorage[+2]  No offense to Amazon, but I was able to find one online for just over 200 bucks (I'm sure prices here will continue to sink), and that also seemed quite a good bargain for the amount of storage space.  Now the downside:  One of the features that factored into my choice of a Micro!  instead of an iPod (I know this is a tediously recurring theme in these reviews, but I want to get my two cents in) was the FM radio.  radio feature[+1]  I like some local stations, Stern, and NPR, and so the radio seemed like a great option.  FM reception[-2][u]  Imagine my disappointment, though, when the Zen Micro proved able to play only the mega-strongest FM signals in my area.  FM reception[-3][u]  It seems like you need to park yourself right next to a radio tower for the Micro to pull in a strong sound.  battery life[-2]  The battery, as others have said, also seems weaker than Creative suggests.  Here's a quote from Creative's web site (hoping to sell additional batteries):   \"Carry an extra rechargeable battery for your Zen Micro for an additional 12 hours of nonstop music.\"  Try an additional *six* hours, methinks.  creative[-2][u]  Still, that's enough time that I'm still satisfied, if a bit grouchy with Creative's overhyped promises.  headphones[+1]  Have not had any issues with the headphones or fragility.  player[+1][u]  As I said, I don't regret the purchase at all.  To use a bas!  Zen micro[+2]  eball metaphor: I was hoping Creative hit a home run here, and I think the Zen Micro is more like a stand-up double.  player[-1][u]  Respectable, solid, but not awe-inspiring.","sound":2}