{"Text":"This is a difficult player to review because I would recommend it on a case-by-case basis.  If you're not computer savvy or if you want things as simple as they can be, get the iPod.  Bottom line.  However, since you're reading this review, you want to avoid getting an iPod.  For whatever reason. There is also a low number of people, like me, who love iTunes but want to get the Zen Micro.  I'll talk more about that later.  First of all, why does every single piece of media library software that comes with an MP3 player suck?  (iTunes being an exception of course).  feature[-2][u] ##The Creative MediaSource software that comes with the Zen Micro is cluttered, and excludes my favorite feature in iTunes, the ability to automatically copy everything you import into a certain folder.  I like to keep all of my Mp3s in one folder and manually doing this is a pain.  Bottomline, don't even bother with the software that comes with the Zen Micro.  Player[-1]  NAGATIVES of the Player itself:  You need to do a little work before having full enjoyement of this player.  1.  Set the sensitivity of the touch pad to LOW.  Also, as soon as you select a song and set your desired volume level, put the player on HOLD.  sensitivy[-1]  Even on the LOW sensitivy level, a slight touch can skip or pause the track.  2.  Update the firmware which can be found on the Creative web site.  This fixes some glitches such as the player freezing.  POSITIVES:  Reasons for getting the Zen Micro instead of the iPod:  1.  battery[+2]  The battery is removable.  You can buy a new battery for 49.99.  With the iPod, if the battery has reached it's life span (after about a year), and you didn't buy the warranty from the store, you need to buy a NEW player.  2.  FM radio[+1]   FM radio built in (Howard Stern).  3.  microphone[+1]  Record memos using the built in microphone.  4.  looks[+2]  The player looks SO much better when you're actually holding it.  The photos don't do it justice.  back[+2]  The back of the player is nice too, with water ripples inside the clear white coating.  5.  storage[+2]  You can use it as a storage Hard Drive.  Now, about the iTunes.  iTunes[+1]  I have no problem using iTunes with the Zen Micro (in a makeshift sorta way).  This is what I do:  I copy all the music I want to import to the Zen Micro into an iTunes play list.  After that, you connect your Zen Micro and open My Computer.  Click on \"Zen Micro Media Explorer\" and then click on \"Transfer Data Between PC and Device\" after that, a File Explorer window opens.  And all you do is select all the tracks in the iTunes playlist and drag them to the File Explorer window.  It's not as seamless as if you were to use an iPod, but it only takes a few seconds longer.  So yeah, you can have the best of both worlds.  * Of Course, if you've BOUGHT tracks from iTunes, this won't work.  You can only copy songs you've downloaded for free or ripped from a CD.  **I honestly don't see the point of buying songs from iTunes when there are so many free alternatives.  But if you get that \"fuzzy legal feeling\" from paying for songs, at least buy them from allofmp3.com, there are no restrictions and the songs cost pennies.","software":-2,"player":-2}