{" sound quality":3,"Text":"Zen micro[+2]  The Zen Micro is near perfect.  I bought my Zen Micro last december as a christmas gift to myself, save for a few software issues, I couldn't be happier with my purhcase.  I've owned this player for nine months now and it's been on 5 cross country trips, one trans-atlantic honeymoon, and numerous roadtrips.  It's been in my pocket, in my car, and in my bag in 20 inches of snow and 100 degree summers.  3It's been dropped, shuffled, kicked, and Lumbered.  built[+3][u]  It's still alive, still kicking, and still playing.  I've never owned an Ipod, so this won't be a which one is better review.  All of my files are mp3 or wma, Windows Media Player is my primary music suite, i use it to burn, play, rip, and sync.  So starting out i knew i wanted a windows friendly player.  windows compatibility[+2][u]  The Zen Micro (mine's black) has a lot going for it.  features[+2] ##It fits into a hand well, it has a removable battery (this is important), great sound quality, fm stereo, recorder, smooth UI, and a feature that most unipods lack... char!  m.  When it's being used or charged it emits a low pulsating blue light.  It's doesn't have a scroll wheel, but it has a strip!  Most people complain about the sensitivity, but it can easily be adjusted for personal preference.  My ONLY complaint is that when i first received it, it was a little buggy.  work with WMP[-2]  It wouldn't always work seemlessly with WMP and it often required me to restart the frozen micro by taking out the battery and restarting it.  over and over again.  But after a few firmware releases it's working without a hitch.  I've programed WMP to throw a few favorites on there all the time and always put my new music (less than 3 months) on so I can listen to them in the gym.  accessories[+3]  The accesories that come with the player are great.  bag[+1]  White earbuds ( i replaced those with some shure headphones, big difference), a case, a stand, a clip (which doesn't really work), and a nice little zen micro bag.  Also all the required cables and what not.  To me, currently at $218, this player is a!  player[+2][p]  best in class.  player[+2][p]  It gives you the most bang for your buck, period.  quality[+2]  Creative has been making computer sound equipment for decades and with the zen micro it finally has something with enough quality and, yes, charm to win a nice size of the digital player pie.  player[+][s]  Pick your favorite color and buy it."}