{"Text":"After heavy duty research and reading reviews, I decided to plunge into the MP3 player circus and got myself the Zen Micro.  Why not join the iPodders like the rest of the world?  I have my reasons.  I've played around with a friend's iPod a couple times and it IS a cool unit.  design[+1] ##Perhaps I bought the Micro to be different, the cheaper price tag (from Amazon), the design, or avoiding the high iPod theft in NYC subways.  player[+2][p]  Whichever it may be, I'm happy I've made this purchase.  I waited a week to make the Micro worthy of a review.  size[+2]  When I opened the box, I was shocked by the size of this thing... It's TINY!  size[+2][u]  It's shorter, sleeker, more compact and fits comfortably in my small hand than the iPod...My Nokia cell phone towers over this bad boy!  trim[+1] ##The interface has a sassier flair and the blue-lit trimming is an added bonus.  The iPods, like most Mac products, have a sophisticated but bland, look to them... Preferrably, I like some sass.  :) I was also happy that my shipment came with all the accessories (minus extra battery).  In stores, the Micro doesn't even come with the AC adapter.  sound[+1]  Moving on to sound department... It delivers!  I expected this coming from Creative.  bass[-2] ##The earbuds, on the other hand, are decent in sound, but lacking in bass.  earbuds[-1]  I've since replaced it with a pair of black Sennheisers... Not only are the packaged earbuds pretty uncomfortable, but are too similar to iPod's and can target iPod theives here in NYC.  touchpad[-1] ##Functionality, menus are easy to navigate... As many have mentioned, the touch pads take some time to get used to, but I've gotten used to it.  I actually prefer the vertical strip rather than running my thumb in continuous circular motion.  design[-1]  Although, I thought it could've been designed a bit better.  extra features[+1]  There are extra features packed inside this unit (some that most will hardly ever use) such as FM radio tuner, voice recorder, calendar, and alarm clock.  I'm guessing the more features you enable, the more the battery will drain.  battery usage[+1][u]  Speaking of battery, it's removable AND replaceable!  The life-span on it, though, is NOT as advertised, but if you're not a heavy user, you can tick in at 9-10 hours of playback.  And if you read the description on Creative's site, it does mention that the \"actual battery life will vary with use.\"  Micro[+2]  Overall, the Micro is a solid device and I haven't fell into a problem with it yet *knocks on wood*.  storage[-1][u]  It's perfect for those who aren't planning on storing tons of music.  music transfer[+1]  Transferring music is a breeze. I don't subscribe to music services, but as mentioned on other reviews, Micro allows you to subscribe to services OTHER than iTunes.  sound quality[+2] ##It may not top the iPod Mini, but it's definitely an alternative if you also want the extra features and good sound quality.  look[+2] ##Strong Points: - Design: small, comfortable, curved, and stylish.  variety of colours[+2]  Colors: 10 variety of HOT colors made it difficult to choose from.  sound[+3]  You don't need to cough up an extra couple bucks for a \"special edition\" to get black! - Sound: Awesome! - Batteries: removable\/replaceable.  audio formats[+2]  - Audio Formats: supports both MP3, WMA... And yeah, WAV too.  volume control[-1] ##Weak Points: - Touch Pad: design could be better - Volume Control: controlled through the vertical strip, but purchasing a headphone with built-in volume control will do the trick.  FM reception[-2][u]  - Radio Quality: weak reception","functionality":2,"price":1,"touch pad":-2,"earbuds":1,"features":2,"interface":1,"design":2}