{"Text":"I first signed up for Napster on line.  Loved the service so much I decided to buy an MP3 player and upgrade from the basic Napster to Napster To Go.  They have a list of compatible players which I miss read.  So my first MP3 player purchase was incorrect.  To transfer songs requires you to pay 99 cents.  The player I first purchased was the Creative Nomad Jukebox Zen Xtra 40 GB MP3 Player.  This player is not compatible with Napster To Go.  The player was large and bulky.  The buttons are located on the sides making it difficult to use.  The plus was the storage size but I didn't like hearing the hard drive spin.  I also hated the packaging, with a passion.  It was one of those plastic glued containers that can take you thirty minutes to open.  Accessories were cheap looking.  The player was not very appealing either.  All this before I found out the bad news.  Finally I upgraded the firmware and log in to Napster.  Upon logging in I received a notification that my player works with Napster but not Napster To Go.  It was time to exchange it for the other player the Creative Zen Micro 5 GB MP3 Player Black.  Its a few bucks more and has only 5 GB's of storage but its well worth the trade off.  This is Creative's attempt to compete with the IPod mini.  To bad Napster software is not compatible with Apple IPod's.  Its my first purchase choice.  Actually only three players are on the list for Napster To Go.  player[+3][p]  Don't worry this player rocks.  appeal[+3]  It was also the most appealing.  Immediately you could tell a very distinct difference between the two Creative MP3 players.  packing[+3][u]  For the Zen Creative focused on packaging which looked well thought out, well presented and easy to open and put back together.  I keep boxes for all my equipment for storage and moving.  casing[+3]  It has a cardboard slip cover with a nice layered box casing inside.  You will find a small folder\/envelope on top along with the player.  Accessories are in reusable bags unlike the Nomad which requires you to tear each back plastic store bag open.  case[+3]  A distinct IPod relation is evident with white colored cables, power plug and the very nice Zen case with a white rubber inside covering.  It has Apple insipid written all over it.  design[+3]  I do give create to Creative for their attractive design.  functionality[+2]  Creative has put a lot of effort into making this player appeal to those true geeks that search for coolness and functionality in electronic devices.  Creative was defiantly giving the IPod a run for their money with this device.  player[+][p][cs] It makes the Nomad I purchase feel and look like junk.  quality[+2]  Everything shines of quality.  player[+1][cs]  I was more excited about this player upon opening than I was about the Nomad.  First I removed each piece and laid them out on my coffee table.  accessories[+2]  I am now staring at an array of stuff including Zen Micro player, stereo earbud headphones, a rechargeable lithium-ion battery, an AC\/DC power adapter, a USB 2.0 cable, a belt-clip, a stand, a stylish cloth pouch, an installation CD, a quick-start guide, and Creative MediaSource software.  Next I wanted to update the software, after a quick firmware upgrade the player was ready to go.  I sync the player with Napster software and it downloaded the library I had already created.  My PC only supports USB 1.0 not the 2.0 which is blazing fast.  So the download was much slower.  interface[+3]  The interface works great.  touchpad[+2]  I enjoy getting use to the touch pad.  navigation[+2]  In minutes I was easily navigating through the menus.  sound[+3]  What impressed me most was the sound.  sound[+3]  At 128 the songs sound very good.  My hobby is home audio and home theater.  audio quality[+2]  The Zen lives up to the audio quality I love and expect.  headphones[+2]  The Earbuds are great headphones as good as my AGK Studio 240, well not as good but darn close.  Creative says that the software engine for this MP3 is the best hands down.  I believe them.  Overall this play is my introduction into the market.  Zen[+][s] The Zen was an impressive purchase and I would highly recommend it to anyone using Napster.  If you're an itunes person then no one could argue against an IPod."}