{"Text":"I would give the Creative Zen Micro five stars without hesitation...except for the eight hours of my life I can never get back.  Doing what, you ask?  Why, troubleshooting, mediating software conflicts, devising workarounds, and when things got too bizarre, even calling tech support.  Now, there's nothing wrong with the Zen Micro a few months in beta testing wouldn't iron out.  But, they rushed it to market, so you, general public, get to roll the dice.  Are you feeling lucky today?  Who knows -- you may avoid a migraine altogether.  sound quality[+3]  Before you run out and buy an iPod, understand something: there are REASONS the Zen is worth encountering this kind of hassle, principally excellent (for MP3) sound quality.  headphones[+][cc]  The supplied headphones are hands-down better than the mediocre iPod buds.  That said, you can get more of what the Zen is capable of by donating them to your local iPod person (they're white) and getting a pair of $60-$80 aftermarket headphones.  I'm getting stunningly good resul!  ts with Sennheiser HD-497 phones.  Going further up-market and using super hi-rez audiophile headphones is probably overkill; they will only serve to cast MP3 limitations into sharper relief, and honey, you can't hear what ain't there.  An aside about sound quality: You can have good sound or 2,000+ songs, not both.  You're better off not dropping below 128 kbps, especially with music.  64 kbps is a terrible price to pay.  If you absolutely, positively need over 2,000 songs for your next wolverine photo shoot, get a 10 GB player.  size[+2][u]  The player is smaller than you think.  Something about the pictures suggests a deck-of-cards size, but you can hide the Micro completely under a standard business card.  touchpad[-2]  The touch pad is over-sensitive, and is adjustable to only slightly oversensitive.  You quickly learn to brush your thumb ever so lightly over its surface.  To minimize any frustration (and the odds that you may return a usable unit), keep the following in mind:  1. While your unit is!  unboxed and charging up, visit the Creative website for necessary firmware and\/or driver upgrades, especially if you're planning to use a service like Napster.  Keep in mind the required upgrade may be a beta version (mine was).  2.  Some upgrades are needed for the Micro to work properly with the Windows XP operating system and Media Player 10.  3.  You may need to briefly disable various spam blockers, cookie swatters, and antivirus programs (I know, I know -- get offline first).  My gatekeeper programs kept fixes away a few times until I got wise to it.  music subscription service[+2] ##Bottom line: If you value excellent sound quality and the ability to use music subscription services, and are willing to deal with the possibility (not the certainty) of setup gremlins, by all means get the Zen Micro.","sound quality":3}