{"Text":"If you are like me who wants move to the next phase of portable audio from conventional portable CD players I hope you find this usefull.  Space : 5GB =2500 songs.  If you have a huge CD collection, 5GB can hold only a part of your CD collection.  Remember mp3 format lets you store tons of songs.  I have stored 40 audio CDs and i still have close to 2.8 GB free.  software[+2]  User Interface: The software is simple and straight forward.  Havent read the manual till now (remember I am good time computer user).  PC  software[-2]  PC software that comes with the player is not as simple as i Tunes but its not bad at all.  scroll bar[-1]  The scrol bar agian takes some getting used to.  storage [+2][u]  You can use the player to store your computer data files (Good feature to have).  Battery[+3]  Battery : A Big Big plus.  Most of the other players I checked dont have user servicable battery.  Zen micro does.  I have two spare batteries (brought on ebay for 28 bucks each).  Remember this is a huge plus when travelling.  battery life[+2][u]  Each battery lasts about 10-11 hours.  If one battery drains just snap the spare one and you are back in bussiness.  battery charging[+2][u]  Another good feature is that you can charge the battery by just connecting the player to your computer using the USB cable.  FM tuner[+2]  FM tuner & Microphone : Having a tuner in the player is a blessing.  Dont have to switch to another device for FM tuner.  FM reception[-2][u]  Since zen does not have an external antena it has some problems catching weak signals but it works.  microphone[+3]  Builtin microphone is great for recording short voice notes.  I have heard in other players these have to be brought separately.  sound[+3]  Sound: This is where I love Zen the most.  sound[+3]  Excellent sound I mean the player has juice.  I dont use the headphones that come with it instead I use Bose Triport headphones.  The player has great potential (ur experiance may differ based on your headphones).  treble[+3] ##The bass treble the sound detail is awsome.  player[+][cc]  I compared it to other CD players (Two models of Panasonic, Rio & samsung) and they were no way even near Zen Micro.  look[+2]  Looks and shape: I have a black one and the first time I charged it and switched it on jeez the blue light looked so cool.  size[+2]  Its compact and has rounded edges.  size[+1]  Fits well in hand in trouser pockets.  stand[+1] ##Freebies you get: A cradle with detachable stand and belt clip, some thing very handy and useful.  design[-2] ##I dont use the belt clip cuz it fails to hold the player securely (design problem).  Instead I use a cellphone cover with a belt clip and it works just fine.  accessories[+2] ##You get a USB cable headphones, a pouch, software except headphones you will like every thing else.  beltclip design[-2] ##What I dont like: Nothing much except Headphones, Belt clip design.  Creative has not lounched any silicon cover for the player like ipod's (I think belkin makes it for ipod).  Stuff you may need to buy: Wired remote from creative.  This is a must have.  Spare batteries incase  you need some extra hours without charging.  sound[+2]  FM transmitter (belkin has a good one) to use Zen with your car Sterio FM Tunner   Latest Find: Connected this baby to my $3800 audiophile audio system and it produced clean sound compared to Ipod.  Tested with the same mp3 for benchmarking","belt clip":-1,"bass":3,"headphones":-2}