{"Text":"Every few years I crawl out into the electronic world, in search of a new MP3 player to replace the horribly inadequate one I currently own.  Zen micro[+2]  This year, it seems that I choose my timing perfectly, having discovered the awesome device that is the Zen Micro.  Of all the players that I have owned in the past (6 of them), all of them have had drawbacks and problems.  Although some came close to perfection, none of them left me completely happy with their performance.  To me, the key elements that must be present in an MP3 player are as follows:  -Fast transference of songs to player -Well-designed computer-side interface -Easy menu navigation and well-designed control scheme -Good sound (duh) -Reasonable battery time (~6 Hours)  That's it?  You ask, yup.  That's it.  I know this list is horribly unreasonable, which is why it amazes me how many players lack some of these basic features.  Slow file transfers, menus that take ages to cycle through, and poor battery life plague many of the!  players that are currently available, but not the Zen Micro.  My list of \"nice to have\" features is a little longer, but it also contains nothing unreasonable: backlit screen, removable battery, FM Radio feature, ID3 Tag line support, lots of storage.  features[+2][p]  Everything that I have listed above, the Zen has, and more.  navigation[+3][u]  The menus are easy to scroll through; they are laid out naturally, and make sense.  interface[+2]  The computer interface is 90% good, only losing points due to the fact that \"Creative\" branding is all over the place within it.  battery life[+3] ##Songs transfer lightning fast, and the two batteries that came in my box give me 24 hours of listen time.  features[+2]  On the fly play list creation, address book, removable storage drive capabilities, sound recorder, the list goes on people, this thing is literally so chalked full of goodies, it was like Halloween all over again.  ease ofuse[+2] ##So far I have used all of the above-mentioned features, and find them well designed, and easy to understand.  Not everything in this world is 1!  Zen[-2]  00% good though, and the Zen does have a few drawbacks.  file transfer[-2]  While transferring songs to the player, the interface has crashed a few times (4-5 times in a 4-5 hour period) normally this would cause me major concern, but it appears that this bug is reproducible, which leads me to believe that Creative will fix it with a patched version shortly (or maybe it's just my computer).  response speed[-1][u]  Another thing I don't like is that some of the features take 1-2 seconds to load up.  These are limited to the voice recorder, address book, and such.  I will be using the player 99% of the time as an MP3 device, so these small pauses are entirely bearable, for the added features just to be available.  Really that's all I can find wrong with it, it took some major bouncing around to get a song to skip (there is a hard drive within), and I don't forsee jogging (wich I plan to do with it tonight) to cause any problems whatsoever (if it does, I'll update this).  plaeyr[+][s]  That's it for now, what are you doing still reading this, click the \"Add to Cart\" button already!","transfer speed":3,"design":3}