{"Text":"features[+3] ##This player is fantastic in terms of audio quality, ease of use, and features.  However, if you are considering purchasing one to use with subscription music services like Napster-to-go, or Yahoo Music Unlimited, there are a few things to keep in mind:  1.  usage with subscription service[-2][u]  To use the Creative Zen player with a subscription service, you need to go to Creative's web site, and download new software for your PC.  You will also need to download and install new firmware on the player.  At the time of this writing, that firmware is a \"beta release.\"  set up[-1]  I haven't seen any problems yet, but if you don't like to tinker a bit, this player can be a little challenging to set up.  2.  transfer speed[-2]  Right now, the Creative software transfers subscription music files very slowly.  It makes USB 2.0 feel like USB 1.1.  subscription WMA[-1]  This doesn't affect standard MP3 files - just subscription WMA files.  The solution?  Use Windows Media Player 10 to do your transferring.  transfer speed[-1][u]  The subscription files are still a little slower to transfer, but it's only by about 10% or so.  3.  Subscription files need to buffer when you first hit \"play,\" so there's a 4-7 second delay before the first song starts.  However, once an album is playing, there's no gap between songs.  The player intelligently pre-buffers the next song.  subscription DRM-encoded[-1]  Again, this doesn't affect regular MP3 files - just subscription DRM-encoded files, like those from Napster-to-Go or Yahoo Music Unlimited.  These issues knock a single star off the review.  player[+1]  Otherwise, this is a great \"alternative\" MP3 player for those of use who don't want to worship the mighty all-powerful Apple.  player[+2][p]  I got it to use with the new $5-per-month service from Yahoo (Music Unlimited,) and despite the above issues, I love it.  The subscription service lets me download as much as I want, and the player lets me take it wherever I go.","audio quality":3}