{"Text":"player[+3][p]  I have had several MP3 players over the past few years, and have to say that this by far is the best that I've owned.  (The others include: the Intel Pocket Concert, the Archos Jukebox, which was returned after three or four faulty units...I'm extremely patient, and the Creative Labs Nomad Jukebox 3.  ) A previous reviewer has mentioned several different issues with the 'Zen Micro'.  However, their player seems to be defective and Creative Labs should be contacted before making such harsh statements if they haven't been contacted already.  I must say that there are several factors that influenced my purchase.  An Apple Ipod Mini was considered.  features[+3][cc]  However, the Ipod does not come close to the number of extra features that the 'Zen Micro' has to offer.  extra features[+2][u] ##Some features that the 'Zen Micro' has that sold me on my purchase include: a 5G hard drive...actually an SD flash card drive...very large and much more than actually needed, the ability to sync with Microsoft Outlook's calendar, the long battery life of about 10 to 12 hours (I can change the battery myself for about $40 to buy vs.  microphone[+2] ##sending the unit to the company of purchase which costs about $90), the ability to record with a built-in microphone (great for recording reminders and meetings), very sturdy construction, and not to mention...the sound quality is excellent!  user interface[+3]  As far as user interface is concerned, the best and easiest to use seems to be the one that comes with the player, 'Creative MediaSource Organizer'.  It comes with a built-in program simply entitled 'Creative MediaSource Audio Converter'.  converter[+2]  This program enables the user to batch convert and convert audio files from one format to another.  These include: MP3, Wave, WMA, WMA Pro, and WMA Lossless; it is very user-friendly simply by right-clicking the file(s) to be converted.  Creative zen Micro[+3][p]  By far this seems to be the best value out there for the money; if you are undecided, the Creative Zen Micro seems to be the best choice."," battery life":3,"construction":3}