{"Text":"I have been researching MP3 players for the last two weeks.  Of course the first one I decided to research first was the Apple iPod.  However, as soon as I found out that I could only download songs from iTunes, I immediately decided that was NOT the MP3 player for me.  In addition, I didn't like the fact that I'd have to pay $.99 for each song I wanted to download.  So I went to www.playforsure.com to see what devices were compatible with various downloading services.  I had been eyeing the Creative Zen Micro 5GB as I researched various players.  Napster 2 go compatibility[+2]  I finally decided to purchase this player because it was compatible with Napster 2 Go....which is a subscription service, allowing me to download as much music as I want for a $14.95 flat fee.  I have a lot of songs that I need to download.  I was going to purchase a pink one and then decided that I'd get a purple one because that's my favorite color....however Circuit City had it for $10 cheaper ($219.00) in black and I could !  pick it up from the store.  So I decided on the black one.  player[+2][p]  And I must say...this MP3 is very cool.  It is exactly the same size as my flip phone.  look[+2]  It's so cute...and behind the black panel it glows in a neon blue.  installation[+1]  After installation, which was VERY simple....I downloaded any updated software from the Creative website, before I downloaded any music.  There were two downloads I had to complete.  One was the firmware upgrading from the installation CD and the second was regarding the \"playforsure\" (even though it's in BETA), to make sure I could use Napster 2 Go.  I then registered with Napster 2 Go and it immediately recognized my player.  And within one hour I had downloaded , organized my play lists and was listening to the songs I downloaded.  Napster 2 Go also allows members to view other members play lists in different genres, so if you are looking for lots of songs and you don't want to search for them endless, you can just grab them from other members play lists. !  sound[+2]  The sound is very nice.  I feel like it's just me and the music and I am transported into a different world.  It also comes with a case so you can either stand it up or use a belt clip.  So I can't wait to get on my treadmill with it.  lock feature[+1]  I also like the lock feature, so it makes the touch pad inactive.  FM reception[-2]  I tried to use the FM radio option, but it doesn't seem to really pick up the stations I listen, however I am going to try it in a different location, it may have just been my residential location.  I would say the only thing I need to adjust is the sensitivity of the touch pad.  touchpad[-2][p]  Even when I set it to low, it's still very hard for me to adjust the player to where and what I want it to do.  However, I am going to try the suggestion of changing the sensitivity to high and see if that solves the problem.  player[+2]  Otherwise, I am extremely please with the Creative Zen Micro 5GB MP3 player.  PS.  I've been ZETAZEN long before this player came into existence...lol and my player's name is ZETAZEN.  :-)  www.zetazen.com"}