{"upgradibility":3,"look":2,"phone":3,"Camera":3,"colors":3,"use":3,"interface":3,"log":3,"priced":-2,"Text":"Its been 11 months now that I've held on to my Nokia 6600 for.  I purchased this phone knowing it was slightly old as compared to the newer models of Nokia phones available.  I thought it was kind of steeply priced at that time.  I must add to the dismay\/delight of readers this phone is simply the most groundbreaking phone mankind has ever held.  It has raised the bar owing to number of features it offers and the absolute ease of use delight.  Now I'm a techy and like getting technical about things so I'd brief you in on the few features I liked about this phone-  1.The Phone has the best keypad any Nokia phone has to offer.  My dad has a Nokia 6670 before which he has a Nokia 7210 and before that he had a Nokia 6610.  I think the keypad on your cell phone is the most important thing for me as Im constantly sending messages , calling people and fiddling around with my phone.  Believe me when I say this I have used and fingered all Nokia phones and the 6600 has the best keypad  2. The looks are absolutely no nonsensical.  Some complain it being a tad too bulky looking.  I must admit its not the best looking phone ever but then it has this look of static and absolute conviction that looks like everything a phone should be  3. The Nokia 6600 has a brilliant Java interface.  There's a whole lot of things you can do with this phone besides reading a book , playing various Java games , having a variety of software installed.  The Phone offers a 32 Mb MMC card and I think that is certainly the most exciting feature.  I upgraded mine to a 128 MB MMC Card via which I can store unlimited number of messages, take a thousand pictures and videos.  Capacity is not a problem here.  4. The Build is just right.  The phone is sturdy.  I've dropped it atleast a dozen times to my recolletion and it still works as good as ever.  Its a tough one this unless you wanna drive your car over it.  This isn't the most rugged phone ever but then your not gonna play aeroplane with this,are you.  5.The Camera installed on this phone is awesome.  I click pictures in JPG format and because the phone has a bluetooth device I find it extremely easy to transfer pics to my pc and forth.  The display and brightness on this phone is quite extraordinary.  The use of 65536 (16bit) colors ensures you get your share of animations and icons on your phone  Besides the above mentioned Merits , the phone has decent ear volume and loudspeaker functionality.  It has great upgradibility.  I can play MP3 files on my phone by simply downloading softwares freely available on the net.  Now that is neat.  The log functions helps you track down the incoming , outgoing calls in the most easy of ways.  The handsfree provided by the phone is useful for those who talk on the phone while driving.  I wouldn't do that because it's not worth my life.  processor[-3] Anyhow some demerits of this phone, The phone has a slow processor and the ear volume is lower than 6610 but then the 6610 has the best ear volume among most Nokia variants.  The battery life of this phone is at most 2 days and at least one day at excessive use.  Video recording is limited at just 9 seconds.  You can upgrade but then there's a certain level of trouble involved.  Overall I dont think I will ever upgrade from this phone.  When I purchased this phone , I thought to myself that I had purchased the most popular phone around and the thought didn't please me.  In any case , putting aside how common it is in my city , I dont think I can be anymore satisfied.  This makes for a great phone.  Did I mention the note feature and how you can send notes via Bluetooth?  gee anyways ENJOY WHAT WORKS!","bluetooth":3,"battery life":-2,"Video recording":-2,"Build":3,"handsfree":3,"keypad":3,"Capacity":3}