{"PHONE":-3,"Text":"*****DO NOT BUY THIS PHONE***** ****READ WHY****  In October of 2003, I bought a Nokia 3650 off of eBay.  It was an OK phone with a really nice screen, great battery life, decent signal, and cool applications.  It was a major step up from a Sony t68i.  The 3650--being essentially a mini-computer--had memory leaks and occassional crashing, but nothing that a quick power cycle couldn't help.  Most importantly, it allowed me to get on the Internet via Bluetooth via GPRS flawlessly.  It's a nice phone, and I'm glad to have used it.  In July of 2004, I purchased a Nokia 6600 from T-Mobile.  Since I use my Palm PDA and T-Mobile offers unlimited Internet, I asked the sales representative if I could use this phone as a Bluetooth modem for my Palm, and he said yes.  So I bought the phone and went on my merry way.  BLUETOOTH DOES NOT WORK ON THIS PHONE.  THE ADVERTISING IS A LIE.  Though nearly a dozen different people at both T-Mobile and Nokia have told me otherwise, it is simply not possible to use this phone as a Bluetooth modem for the vast majority of PDAs and many other devices.  While the two devices will pair, the phone will immediately drop the connection if any data is transferred.  With the recent \"bluejacking\" vunerability, the Bluetooth overseers have created a new security system called Combination Key.  This helps prevent people from sending short \"obscene\" messages to your phone.  The older security method is called Unit Key.  Most Bluetooth devices only support the older security system, Unit Key.  This includes ALL Palm PDAs! Further, due to an unparalled design oversight, Nokia is the only device that supports Combination Key that is NOT BACKWARDS COMPATIBLE with the older devices that people actually own.  Does all this sound technical?  That's because it is, and the only way I learned it was by spending over an hour talking to T-Mobile's tier-3 technicians in South Africa (to learn that the problem wasn't about T-Mobile) and three hours of getting nowhere with Nokia support technicians reading endlessly from scripts, never deviating, until I started cursing and got a tier-2 tech.  Only then did I learn the truth -- THIS PHONE DOES NOT WORK WITH PALM PDAS!  So, after all this frustration of adding all of my newest contacts to the 6600, I asked the technician if it were possible to transfer the data from the 6600 to the 3650.  He advised me to back up the 6600 to a newly formatted Nokia MMC card, and restore the data to the 3650.  I followed the technician's directions to the letter while they were on the phone, and after I had done so, the phone restarted and displayed the message \"Phone startup failed. Contact the retailer.\"  I spent over an hour talking to a tier-2 technician who told me that their tier-1 technician should have known that it was not possible to backup the 6600 to the 3650 safely in any condition.  I could not get the 3650 working to even factory defaults, even after trying every reset code they could muster.  Nokia finally determined that my phone was in need of repair, but since it was out of warranty (it was made in May '03 and they would not take an eBay purchase as proof) they refused to fix the phone for less than $120!  After over two hours of being placed on hold and persuasion, a supervisor finally agreed to fix the phone for free.  I did a little research and discovered that the repair could be done by any basic cell-phone for $30.  All that had to be done was restore the software to the phone, and all that took was a cable and some Nokia software.  I still decided to send in the phone, since insured shipping was only $10.  Two weeks later I mailed the phone in for repair.  Two days after they received the phone, I received a letter in my mailbox stating that if I did not pay $120 for the repair of my phone, it would be returned unrepaired.  I called Nokia to try to get it sorted out, and they stated that they had no recollection of ever promising to repair the phone for free.  They stated that though it was a simple repair they would not do it for less than $120.  I suggested that it didn't make sense for me to send in the phone for repair if I thought Nokia would charge me $120 to repair it since I could get it done locally for $30.  This simple nuance was too much for Nokia, and they still refuse to acknoledge the fact that their technician could have broken the phone or repair the phone for free.  The supervisor stated that it must have been third-party applications on the 6600 that caused the 3650 to break, and would not take the suggestion that his own tier-2 technicians stated that it was not possible to back up the 6600 to the 3650 without damaging the 3650, regardless of what was or was not on the 6600.  In short - Nokia themselves don't know that this phone doesn't work with the Palm, and if you don't heed my advice you will spend hours with technicians around the globe reading from scripts, chiding you in broken english for not following their directions exactly.  You will also hard-reset both your Palm and your Nokia to factory defaults in their lame attempts to get the script to work, though it will not.  Ultimately you will learn just how bad Nokia is, and why their recent loss of market share is so utterly deserved.","nokia":-3,"Bluetooth":-3,"Nokia":-3,"BLUETOOTH":-3}