{"Text":"I have overall been disappointed with Nokia in the past, finding that Samsung and Motorola tended to have better quality phones.  While this phone obviously doesn't have the same quality construction as Motorola does, the Nokia 6600 is one of the better phones I've used.  versatility[+3] What makes it so great is the versatility and the number of features it has.  The best features that I use most often are:  1) Great audio quality overall.  Handset quality is great, as is the speakerphone quality and the headset audio quality.  2) Camera phone.  A decent camera phone for taking quick pictures, movies, and having general all around fun with.  3) The joystick design they are using on the new Nokias gives you a great degree of control.  The only problem is that occasionally the joystick does start to dig into your thumb while gaming.  4) One nice thing about Nokias is that they have a ton of ring tone and game choices.  If you love your cell phone games or changing your ring tones everyday, Nokia beats everyone else.  5) Bluetooth wireless technology, so that I can transfer data to and from my computer without messing with any cables.  This is great for putting photos and memos on the computer and transferring calander data to my phone.  6) The phone is really wide, which seems to be a turnoff for many people, but the phone is actually easier to grip and feel more ergonomic.  I feel much less likely to drop this phone than others, which are actually starting to get too small.  [s] You will probably have to get a belt clip for it, however, unless you wear the pants with the cargo pockets.  My biggest concern is that I have found Nokia phones lower quality construction to lead to lower prices, but they also don't last as long.  I can tell using the phone that it feels a little flimsier than Motorolas do, but as long as I'm not planning on dropping the phone or running over it with my car it should be just fine.  [s] I wouldn't use it for business purposes and hand one out to all my employees, because you tend to want a little more rugged a phone for that.  Other than that it meets or surpasses all of my needs and surely won't disappoint any already established Nokia phone fans.","joystick":-2,"phone":3,"Bluetooth":3,"audio quality":3,"camera":3,"features":3,"ring tone":3,"Nokia":3,"construction":-2}