{"screen":3,"phone":-2,"instruction booklet":-2,"operating system":3,"DEPENDABILITY":3,"game":-3,"interface":-2,"transmission":3,"downloads":3,"memory":3,"Text":"OPERATION: It's like BMW's I-Drive - It does it's job, but has the most unintuitive, overly-layered interface.  For example, the memory card is under the battery.  The phone must be shut down & taken apart to change the memory card... and turning the phone back on takes a little while.  This is representative of the entire phone operation.  Not for the impatient.  If you've never used an advanced mobile phone before, you might assume this is par for the course, but it simply isn't.  Even the instruction booklet is out of order.  APPLICATIONS: It has lots of applications and they work very well... when you eventually find where they are and they finally open.  No matter how accustomed to the phone you become, too much time is required to get to, open and close applications.  On the other hand, one may leave many applications open at once, hide them and return to them just where they left off - similar to a Mac.  Me likes.  The 6600 has more ameneties than most - World phone, Camera (VGA\/zoom\/night mode\/timer), Video (w\/ audio & zoom), Speaker (good sound), Bluetooth, infrared, Modem for computers, electronic wallet, Internet access, Calendar, calculator, converter and more.  The phone does not have an Mp3-player, FM radio, 200k+ color screen, megapixel camera, quad band, PDA, photo editor.  I'm not sure that a phone w\/ these and all of the above features exists just yet. ...I'm not sure I'd want to spend THAT much time w\/ a device, anyhow.  DEPENDABILITY: I've seen no glitches.  I've had no problems w\/ this phone.  STYLING\/ERGONOMICS: The keys are small, which generally doesn't bother me if they are spaced because I can employ a little 'Braille,' but the keys run into each other, so careful attn. must be paid when dialing.  As for appearance, well, that's subjective.  Few will look at the phone and know it's 'all that'.  It's not as stylized as a Sony or Samsung.  Less Benz\/obvious; more Audi\/understated.  Although it has chubby hips, the device isn't really so big.  Solid, squeak-free, large screen.  MEMORY\/STORAGE - Seemingly boundless.  First of all, the phone houses a great deal of memory for multiple videos, sound clips, photos, texts, etc.  Secondly, all info can be sent to a computer and w\/o the hassle of USB wires.  Still not sure?  If you max out the phone memory and have sent all you wish to a computer, there is a memory card w\/ a good deal of storage as well.  This is no small deal.  If you're still whining about storage, deleting some games will free-up still more memory.  RECEPTION: This really depends on locale & carrier.  The 6600 (T-Mobile) is the true 'world phone' in that it has the mhz to operate around the globe, including New Zealand and Australia (900) whereas the  6620 (available from Cingular) replaces it w\/ 800mhz (some refer to as 850).  The latter will provide better coverage in more remote areas of The States but still operates in many countries, excluding New Zealand and Australia.  The 6600 will provide similar service in more developed areas of The States and not as well in more remote areas.  As the 6600 uses 900mhz, it operates in more countries than the 6620.  The battery life is less than stellar, but it charges w\/ the quickness.  Remember, this phone uses an operating system - Symbian... and it's feature-rich w\/ 65k colors.  It films 10 second video, for crying out loud.  The battery life can't be very long; let's not be greedy.  GAMES - Java.  Don't use them, so I delete them for addtl space.  In my humble opinion, games, along w\/ 'flip phones' belong in the hands of teenagers.  [s] IMP: Two important pieces of advice - Visit Nokia's site.  There are number of downloads needed\/available for this phone & they will be texted to you at no cost.  The downloads are for basic and advanced operations.  [s] The second piece of advice - Be prepared to spend a lot of time w\/ this phone.  If you expect to be able to pick things up when you're out and in a rush via common sense, many times you'll end up frustrated.  A Sony Ericcson may be the phone for you... but good luck finding one w\/ all the features & such a competitive price.  [s] Keep in mind that for nearly every screen, there are a number 'along side' and 'beneath' them... for every 'save,' there are choices of phone memory, memory card or sim card.  Despite a critical start, this phone deserves four stars because it accomplishes what it sets out to do (which is pretty lofty)... does more than most... does it well... is dependable.  It's a high-line Audi, on a Cadillac suspension, at a reasonable price.  When you consider expandability (downloads via computer), the numerous features, two transmission programs and multiple storage devices, dependability - this is a phone that isn't easy to out-grow.  [u] I would suggest this phone for all but the simple-minded... or those who simply don't need so many features.","battery life":-1,"MEMORY":3,"applications":-2,"6600":3,"video":3}