{"Text":"This came PRELOADED on our new, 2.8Mz Pentium 4 256RAM computer.  From day one, we've had hangups, crashes, glitches, continual reboots, LONG shutdowns due to \"ccApp.exe\" program running which is a Norton program.  Long reboots due to Norton taking FOREVER  to boot.  We constantly got \"Windows Virtual Memory Low\" error messages popping up follwed by ridiculous slowdowns and\/or crashes.  I don't have one good thing to say.  I agree with the other reviewer that it doesn't even deserve 1 star.  Norton online support does not even acknowledge this problem nor does the computer company that preloaded it on our new computer.  It's a well-known company that I expected more from and spent 2 hours with tech support running all kinds of tests on the computer which of course came back reporting no trouble with the computer.  The tests were right.  It wasn't the computer - it was Norton Internet Security 2004 which is the culprit!!  support[-3]  Norton support is completely pathetic.  We were so fed up that we uninstalled ALL of Norton Internet\/AV 2004 and were going to try McAffee, but a techie friend recommended trying Norton SystemWorks 2005 first.  We were leary to say the least, but decided to give Norton the benefit of the doubt.  We'd used Norton products like Internet Security 2003 forever with only rare troubles.  The SystemWorks 2005 seems to be working GREAT!!  We've only had it 2 days, but so far so good.  (WRONG - SEE UPDATE BELOW)  I hope it's better than this hunk of junk Internet\/AV 2004 package.  If SystemWorks 2005 starts to act up, I'm done with Norton products forever.  But I don't think SystemWorks 2005 will start acting up.  72 hours later after installing, it started doing the exact same things!  So, we're fed up.  DO NOT BUY ANY HOME VERSION OF NORTON ANYTHING.  We were able to obtain a Norton Corporate Edition of Antivirus only (no firewall or utilities) and so far it's great.  I've used the Corporate edition at work without any problems ever.  Unfortunately, you can't buy the corporate edition over the counter.  If we had been unable to obtain the Corporate edition, we would NOT have purchased another Norton 2004 or 2005 home version anything.  We'd have probably tried McAffee, but I hear from reviews that it has troubles too.  HMMMM.. Good luck.  Our Norton Internet\/AV 2004 was terrible right from the get go, so I'd think that if SytemWorks is ok now, it should remain ok.  I'll update my review if I find out otherwise.  WRONG - SEE MY UPDATE ABOVE.  By the way, I use the Norton 2003 Corporate at work with absolutely no trouble.  Likewise, I've heard Norton 2004 PROFESSIONAL version is fine too.  Just the home version of Norton Internet\/AV has too many glitches and problems to even remotely bother with.  Trust me and all the other reviews on this one.","Norton program":-3,"support":-2,"HOME VERSION":-3,"corporate":3,"Corporate Edition":2,"home version":-2,"memory usage":-3,"professional version":2,"Norton Internet\/AV 2004":-3,"Norton":-3,"Corporate edition":2}