{"product":-2,"Text":"I downloaded this set from Norton, and within minutes my Internet connection failed and my PC was almost dead due to registry problems from the download.  I was forced to re-format the next day due to extensive incapatability issues.  I lost all my personal info.  Their site offers no live help at all.  I tried to call Norton, and the only numbers they list on their sites are either for Non-tech Customer Service (tried this one and hung up after 75 minute of MUZAC) or they have a $30 tech-support number.  Who wants to pay $30 to discuss a defect in a product that just cost $95? (I also bought the back-up CD).  I finally got a free support number for Norton through my ISP support staff, but waited an hour or more for a voice.  They said they would refund all the money, but a month later, they tell me now the back-up disc is not refundable as its cost is purely handling and shipping - $15 to \"handle\" and ship a CD? --and they have been indignant and combative on the phone and in emails.  This is a terrible company with a bad product and awful support.  After 10 years, I now downloaded McCaffee's product after calling their support....they answered quickly, and for free, and were very helpful.  No problems now, just a sickly disappointment in the way Norton has abandoned thier customers.  I see many other reviews that say the same....stay away from Norton, they don't deserve you, or anyone!  A security software suite with lots of value  While I understand the complaints about Symantec's Norton SystemWorks software suite (which are totally justified), the same can't be said for Norton Internet Security.  It's a highly rated, KICK ASS firewall program that's bundled with the venerable Norton AntiVirus, plus extras (like Norton AntiSpam & Norton Parental Control) that make this security suite a must-have for people who have broadband internet access.  Detractors should spend more time actually customizing the program to meet their needs instead of being lazy & complaining just for the hell of it.  Once you set it up, you barely even notice it's even there.","help":-3,"support":-2,"firewall":3,"refund":-3,"service":-3,"download":-3,"cost":-3,"Norton":-3}