{"Corpus":"tripadvisor","Overall":2,"Text":"Disappointed I have to say I was anticipating my stay at Hotel Monaco based on the reviews I had seen on TripAdvisor. However, it was definitely a disppointment. The decor of the room and the hotel was as I had envisioned...very nice indeed! The housekeeping staff was very impressive, all were extremely polite, cheery and helpful. However, the front desk  bellmen were below standard in customer service. There were lots of little things that on their own could easily be overlooked, such as the broken make up mirror sagging from it's post in the bathroom, or the jiggly entrance handle to the room (didn't feel too secure when the handle is nearly falling off the door!). My husband had an early morning flight mid-week and we asked for a cab to be called. It was suggested to us that the cab ride would cost double what a private car flat-rate would be, but that wasn't the case at all. I knew the cost of the cab (about $30), and the car would have been $38, but the bell staff insisted that it would be more like $65 for the taxi ride. The cab driver later explained that the bell staff get a kick back for their referrals. I would have preferred as guests in a city and\/or hotel, that the hotel staff be looking out for our best interests rather than their own. We were there for New Years, and had planned on dining at the restaurant in the hotel on New Year's Day. We came down dressed for dinner only to be told by the front desk that it was closed due to the holiday. We asked where else we could go nearby, and the response was good luck finding anywhere today. Good luck? Thanks for the help! Another feature I needed for the hotel was to have a business centre that I could work from. They do have one downstairs, but one computer was out of service completely, and the other one was only semi-funcitional. As their internet service is out-sourced, I ended up spending almost $50 of my own money on a system that wouldn't work (no refund), and 2.5 hours of my vacation time trouble-shooting their computer with the internet company's toll free service line! I had asked the front desk several times for assistance but they told me to do it myself! The worst part of the whole experience was that every time I asked the front desk for any assistance, I got a response that included a shrug, as if to say oh well, too bad for you. I found the majority of the staff had an attitude that they just simply did not care if you needed help, and if you dared to intrude on their time, then I got a snotty response. On two occasions, I even caught the front desk girls smirking at each other when they thought I had my back turned and couldn't see them. Talk about frustrating! In all honesty, I couldn't wait to check out. Nice decor, liked my goldfish, the housekeeping staff were great, but the front end of the hotel made me want to dash in and out of the door so I wouldn't have to get in their way, not that I had to be too concerned about anyone taking it upon themselves to greet me anyway, I was pretty much ignored by anyone in the front desk area unless I approached them. Next time, I'll go across the street to the Westin. I saw nothing but smiling faces coming and going from that hotel. ","Value":1,"Service":1,"Rooms":3,"Check in \/ front desk":4,"Cleanliness":4,"Location":3,"Business Service":3}