{"text":"I thought the central location was great as it enabled us to see all the sights and enjoy london. Transport wise it was placed perfectly and there were loads of options for food and drink nearby. The cafecuba restaurant was good too. I booked a deluxe NON SMOKING room with garden space on the booking.com website for my wife and I who were on a honeymoon trip. Upon arrival I was told my the check in girl that these are all in fact smoking rooms and she warned they might smell a bit. We didn't even need to enter the room before the stale smoker smell hit us so we demanded to be moved. They did find us a non smoking room quickly but it was a standard room with no garden and LOTS smaller- too small. They did take money off though. The point is though that I would NOT have stayed there had I known I would have ended up in that room. The following evening my new wife and I met up with some friends locally for dinner. Afterwards my wife and I came back to the hotel for a quick drink but were not allowed into the members\/residents area as it was a private party. That's totally understandable, I lived in London for 12 years so I know that happens all the time. What I wasn't prepared for was the attitude of the staff member by the entrance of the members area. As we approached we heard him mutter under his breath that he \\\"hoped these pricks aren't coming in\\\" to his colleagues and then proceeded to greet us with a huge fake smile when we got there.. my wife was really upset and I was just angry but it was enough to not make us feel welcome so we just went to sleep and left early the next day. I won't be staying there again.","annotations":[{"endOffset":107,"mention":"Transport","uri":["http:\/\/dbpedia.org\/resource\/Transport"],"startOffset":98},{"endOffset":255,"mention":"NON","uri":["http:\/\/dbpedia.org\/resource\/Saint_Non"],"startOffset":252},{"endOffset":268,"mention":"SMOKING room","uri":["http:\/\/dbpedia.org\/resource\/The_Smoking_Room"],"startOffset":256},{"endOffset":684,"mention":"LOTS","uri":["http:\/\/dbpedia.org\/resource\/Land_lot"],"startOffset":680},{"endOffset":746,"mention":"The point","uri":["http:\/\/dbpedia.org\/resource\/The_Point"],"startOffset":737},{"endOffset":853,"mention":"The following","uri":["http:\/\/dbpedia.org\/resource\/The_following"],"startOffset":840},{"endOffset":1119,"mention":"London","uri":["http:\/\/dbpedia.org\/resource\/London_King%27s_Cross_railway_station"],"startOffset":1113}]}